'''
Вхідні дані: 3 дійсних числа -- аргументи командного рядка.

Вихідні дані: результат обчислення формули


Аргументи передаються в порядку, зазначеному у формулі, назви змінних можуть використовуватися будь-які.

Приклад
Вхідні дані: 1 1 0.25
Приклад виклику: python lab2_1.py 1 1 0.25
Результат: 1.59576912161
'''

import sys
import math

x = float(sys.argv[1])
m = float(sys.argv[2])
q = float(sys.argv[3])

f = (1 / (q * (math.sqrt(2 * math.pi)))) * (math.exp(-(math.pow((x-m), 2.0) / (2.0 * math.pow(q, 2.0)))))

print f
